In [1]:
import libraries as ls

In [2]:
dframe = ls.DataFrame({'k1':['X', 'X', 'Y', 'Y', 'Z'],
                       'k2': ['alpha', 'beta', 'alpha', 'beta', 'alpha'],
                       'dataset1':ls.np.random.randn(5),
                       'dataset2': ls.np.random.randn(5)})

In [3]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  0.441898  1.103248
1  X   beta -1.090039 -0.558179
2  Y  alpha  0.741174 -1.216988
3  Y   beta  0.304485  0.564487
4  Z  alpha  0.916192  0.211781

In [4]:
group1 = dframe['dataset1'].groupby(dframe['k1'])

In [5]:
group1

In [6]:
group1.min()

k1
X   -1.090039
Y    0.304485
Z    0.916192
Name: dataset1, dtype: float64

In [7]:
## 
cities = ls.np.array(['NY', 'LA', 'LA', 'NY', 'NY'])
month = ls.np.array(['JAN', 'FEB', 'JAN', 'FEB', 'JAN'])

In [8]:
dframe['dataset1'].groupby([cities, month]).mean()

LA  FEB   -1.090039
    JAN    0.741174
NY  FEB    0.304485
    JAN    0.679045
Name: dataset1, dtype: float64

In [9]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  0.441898  1.103248
1  X   beta -1.090039 -0.558179
2  Y  alpha  0.741174 -1.216988
3  Y   beta  0.304485  0.564487
4  Z  alpha  0.916192  0.211781

In [10]:
## column name as group keys
dframe.groupby('k1').mean()

C:\Users\looka\AppData\Local\Temp\ipykernel_26480\2362450488.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X  -0.324070  0.272534
Y   0.522830 -0.326251
Z   0.916192  0.211781

In [11]:
dframe.groupby(['k1', 'k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha  0.441898  1.103248
   beta  -1.090039 -0.558179
Y  alpha  0.741174 -1.216988
   beta   0.304485  0.564487
Z  alpha  0.916192  0.211781

In [12]:
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [13]:
for name, group in dframe.groupby('k1'):
    print("this is the %s group" %name)
    print (group)
    print ("\n")

this is the X group
  k1     k2  dataset1  dataset2
0  X  alpha  0.441898  1.103248
1  X   beta -1.090039 -0.558179


this is the Y group
  k1     k2  dataset1  dataset2
2  Y  alpha  0.741174 -1.216988
3  Y   beta  0.304485  0.564487


this is the Z group
  k1     k2  dataset1  dataset2
4  Z  alpha  0.916192  0.211781

In [14]:
for (k1, k2), group in dframe.groupby(['k1', 'k2']):
    print("key1 = %s key2 = %s"%(k1, k2))
    print(group)
    print("\n")

key1 = X key2 = alpha
  k1     k2  dataset1  dataset2
0  X  alpha  0.441898  1.103248


key1 = X key2 = beta
  k1    k2  dataset1  dataset2
1  X  beta -1.090039 -0.558179


key1 = Y key2 = alpha
  k1     k2  dataset1  dataset2
2  Y  alpha  0.741174 -1.216988


key1 = Y key2 = beta
  k1    k2  dataset1  dataset2
3  Y  beta  0.304485  0.564487


key1 = Z key2 = alpha
  k1     k2  dataset1  dataset2
4  Z  alpha  0.916192  0.211781

In [15]:
group_dict = dict(list(dframe.groupby('k1')))

In [16]:
group_dict['X']

  k1     k2  dataset1  dataset2
0  X  alpha  0.441898  1.103248
1  X   beta -1.090039 -0.558179

In [17]:
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes, axis = 1)))

In [18]:
group_dict_axis1 ## seperate the dataframe by the  type of data

{dtype('float64'):    dataset1  dataset2
 0  0.441898  1.103248
 1 -1.090039 -0.558179
 2  0.741174 -1.216988
 3  0.304485  0.564487
 4  0.916192  0.211781,
 dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [19]:
dataset2_group = dframe.groupby(['k1', 'k2'])[['dataset2']] ## dataset2 in the dataframe group by k1 and k2
dataset2_group.min()

          dataset2
k1 k2
X  alpha  1.103248
   beta  -0.558179
Y  alpha -1.216988
   beta   0.564487
Z  alpha  0.211781